import sqlite3

db = "list.db"

# データベースとコネクト
conn = sqlite3.connect(db)
# カーソル
cur = conn.cursor()

# cur.execute("DROP TABLE symbol")



cur.execute("""
            CREATE TABLE IF NOT EXISTS hiragana (
                id INT PRIMARY KEY,
                value CHAR(1)
            )
            """)

cur.executemany("INSERT INTO hiragana(id,value) VALUES(?,?)",
                [
            (0,"ー"),
            (1,"わ"),
            (2,"ら"),
            (3,"や"),
            (4,"ま"),
            (5,"は"),
            (6,"な"),
            (7,"た"),
            (8,"さ"),
            (9,"か"),
            (10,"あ"),
            (11,"゜"),
            (12,None),
            (13,"り"),
            (14,None),
            (15,"み"),
            (16,"ひ"),
            (17,"に"),
            (18,"ち"),
            (19,"し"),
            (20,"き"),
            (21,"い"),
            (22,"゛"),
            (23,"を"),
            (24,"る"),
            (25,"ゆ"),
            (26,"む"),
            (27,"ふ"),
            (28,"ぬ"),
            (29,"つ"),
            (30,"す"),
            (31,"く"),
            (32,"う"),
            (33,"小"),
            (34,None),
            (35,"れ"),
            (36,None),
            (37,"め"),
            (38,"へ"),
            (39,"ね"),
            (40,"て"),
            (41,"せ"),
            (42,"け"),
            (43,"え"),
            (44,None),
            (45,"ん"),
            (46,"ろ"),
            (47,"よ"),
            (48,"も"),
            (49,"ほ"),
            (50,"の"),
            (51,"と"),
            (52,"そ"),
            (53,"こ"),
            (54,"お")])



cur.execute("""
            CREATE TABLE IF NOT EXISTS katakana(
                id INT PRIMARY KEY,
                value CHAR(1)
            )
            """)

cur.executemany("INSERT INTO katakana(id,value) VALUES(?,?)",
                [
            (0,"ー"),
            (1,"ワ"),
            (2,"ラ"),
            (3,"ヤ"),
            (4,"マ"),
            (5,"ハ"),
            (6,"ナ"),
            (7,"タ"),
            (8,"サ"),
            (9,"カ"),
            (10,"ア"),
            (11,"゜"),
            (12,None),
            (13,"リ"),
            (14,None),
            (15,"ミ"),
            (16,"ヒ"),
            (17,"ニ"),
            (18,"チ"),
            (19,"シ"),
            (20,"キ"),
            (21,"イ"),
            (22,"゛"),
            (23,"ヲ"),
            (24,"ル"),
            (25,"ユ"),
            (26,"ム"),
            (27,"フ"),
            (28,"ヌ"),
            (29,"ツ"),
            (30,"ス"),
            (31,"ク"),
            (32,"ウ"),
            (33,"小"),
            (34,None),
            (35,"レ"),
            (36,None),
            (37,"メ"),
            (38,"ヘ"),
            (39,"ネ"),
            (40,"テ"),
            (41,"セ"),
            (42,"ケ"),
            (43,"エ"),
            (44,None),
            (45,"ン"),
            (46,"ロ"),
            (47,"ヨ"),
            (48,"モ"),
            (49,"ホ"),
            (50,"ノ"),
            (51,"ト"),
            (52,"ソ"),
            (53,"コ"),
            (54,"オ")])

cur.execute("""
            CREATE TABLE IF NOT EXISTS english(
                id INT PRIMARY KEY,
                big_value CHAR(1) ,
                small_value CHR(1) 
            )
            """)

cur.executemany("INSERT INTO english(id, big_value, small_value) VALUES(?,?,?)",
                [
                    (0,"1","1"),
                    (1,"2","2"),
                    (2,"3","3"),
                    (3,"4","4"),
                    (4,"5","5"),
                    (5,"6","6"),
                    (6,"7","7"),
                    (7,"8","8"),
                    (8,"9","9"),
                    (9,"0","0"),
                    (10,"Q","q"),
                    (11,"W","w"),
                    (12,"E","e"),
                    (13,"R","r"),
                    (14,"T","t"),
                    (15,"Y","y"),
                    (16,"U","u"),
                    (17,"I","i"),
                    (18,"O","o"),
                    (19,"P","p"),
                    (20,"A","a"),
                    (21,"S","s"),
                    (22,"D","d"),
                    (23,"F","f"),
                    (24,"G","g"),
                    (25,"H","h"),
                    (26,"J","j"),
                    (27,"K","k"),
                    (28,"L","l"),
                    (29,None,None),
                    (30,"⇩","⇧"),
                    (31,"Z","z"),
                    (32,"X","x"),
                    (33,"C","c"),
                    (34,"V","v"),
                    (35,"B","b"),
                    (36,"N","n"),
                    (37,"M","m"),
                    (38,None,None),
                    (39,None,None),
                ])


cur.execute("""
            CREATE TABLE IF NOT EXISTS symbol(
                id INT PRIMARY KEY,
                value CHAR(1)
            )
            """)

cur.executemany("INSERT INTO symbol(id, value) VALUES(?,?)",
                [
                    (0, "!"),
                    (1, '"'),
                    (2, "#"),
                    (3, "$"),
                    (4, "%"),
                    (5, "&"),
                    (6, "'"),
                    (7, "("),
                    (8, ")"),
                    (9, "-"),
                    (10, "="),
                    (11, "^"),
                    (12, "~"),
                    (13, "\\"),
                    (14, "|"),
                    (15, "@"),
                    (16, "`"),
                    (17, "["),
                    (18, "]"),
                    (19, ";"),
                    (20, "+"),
                    (21, ":"),
                    (22, "*"),
                    (23, "{"),
                    (24, "}"),
                    (25, ","),
                    (26, "<"),
                    (27, ">"),
                    (28, "."),
                    (29, "?"),
                    (30, "/"),
                    (31, "_"),
                    (32, "\\"),
                    (33, "×"),
                    (34, None),
                    (35, None),
                    (36, None),
                    (37, None),
                    (38, None),
                    (39, None),
                    (40, None),
                    (41, None),
                    (42, None),
                    (43, None),
                    (44, None),
                    (45, None),
                    (46, None),
                    (47, None),
                    (48, None),
                    (49, None)
                ])

conn.commit()